# First Half

# This is a Jupyter notebook created for training - By Leandro Sartini
## Basic concepts of Jupyter notebooks
### Jupyter notebook is a virtual environment for you to run your Python, SCALA, (R in some cases) commands while you can see what is happening, making it easier to manipulate data on a large and high scale.
### You can run one or more commands per cell (Each line is a cell)
### For each command run, you can see the result immediately, thereby storing it in the computer's memory.
# Menu (Important points):
### File: Revert/Save Checkpoint, for you to create checkpoints in case you do something you think is very wrong.
### Cell: There we have buttons to run all cells, run cells up to a certain point above and below.
### Kernel: Restart (Restarts the machine's kernel) When you do this, everything that was in memory will be erased and will have to be run again, Restart & Clear output is a good method to clear the Jupyter outputs.
# Commands:
### CTRL + Enter: Executes the cell, but remains in the same cell.
### Shift + Enter: Executes the cell and then moves to the next cell.
### A: Creates a new cell Before the marked cell.
### B: Creates a new cell After the marked cell.
### D: The button must be pressed twice to delete a cell.
### X: Cuts the selected cell.
### C: Copies the selected cell.
### V: Pastes the copied cell.
### CTRL+C: Copies the selected cell so that it can be used in another notebook and not in the same one.
### CTRL+V: Pastes the copied cell into another notebook.
### Shift+Tab: Allows you to see the function's DocString.

# Lists: Are mutable objects, used to store multiple pieces of information that can be strategically utilized to manipulate your data.

In [75]:
columns_to_drop = ['Column A','Column B','Column C']

In [77]:
columns_to_drop

['Coluna A', 'Coluna B', 'Coluna C']

In [91]:
columns_to_drop[3]

IndexError: list index out of range

# Tuples: Are immutable objects that can be quickly accessed and are often used for returning multiple responses, which can be accessed rapidly.

In [78]:
tuple_a = ('Pos_1','Pos_2')

In [79]:
tuple_a

('Posicao_1', 'Posicao_2')

In [80]:
X,Y = tuple_a

In [81]:
X

'Posicao_1'

In [82]:
Y

'Posicao_2'

In [85]:
X = tuple_a[0]

In [86]:
X

'Posicao_1'

# Dictionary: A key and value pair response.

## Creating a dict

In [1]:
my_dict = {"name": "Alice", "age": 25, "city": "New York"}

## Accessing it's values

In [2]:
print(my_dict["name"])  # Output: Alice

Alice

## Updating it's values

In [3]:
my_dict["age"] = 26  # Changing the age from 25 to 26

In [4]:
my_dict

{'name': 'Alice', 'age': 26, 'city': 'New York'}

## Adding new values

In [5]:
my_dict["profession"] = "Engineer"  # Adding a new key-value pair

## Removing values

In [6]:
del my_dict["city"]  # Removing the key "city" and its value

In [7]:
my_dict

{'name': 'Alice', 'age': 26, 'profession': 'Engineer'}

### Fim do dicionario

# Pip and Import

## pip is the Python package manager, any library/framework that needs to be installed must be done through pip.
## pip is handled via CMD (Command Prompt)

## pip install pandas

## or
## pip install pandas --upgrade
## to update your pandas

## After the package is installed, it needs to be imported into your notebook, and for this, we use Import.

In [96]:
import numpy

In [97]:
#pandas.DataFrame(columns = ['A','B','C'])

In [98]:
#pd.DataFrame(columns = ['A','B','C'])

In [99]:
A = numpy.nan

In [100]:
A

nan

## Note that if we were to use pandas, every time we execute a function from it, we would have to run pandas.function(). To make this easier, we can give the library a nickname.

In [105]:
import numpy as np

In [106]:
A = np.nan

In [107]:
A

nan

In [108]:
import matplotlib.pyplot as plt

In [109]:
from numpy import nan

In [ ]:
pd.DataFrame(columns = ['A','B','C'])

# Any questions? We will start the second half

# Second Half

# Introduction to Pandas

## Pandas is a Python library that facilitates data manipulation, its potential is huge!

## There are functions for data manipulations, functions like SQL's SELECT to fetch specific data from your database, rename, drop, group, and aggregate columns.

### Great, how do we start? It's as simple as:

In [2]:
import pandas as pd
import numpy as np

# When talking about pandas, it's important to understand two basic concepts: DataFrame and Series

## DataFrame is how pandas reads your data set. In other words, it will take a file in CSV, Parquet, Excel, and other formats and transform it into a DataFrame, which is where you can work on it.

## Series is a one-dimensional array that can contain any type of data, as long as it's a single type per Series.

# Demonstrating with read_ functions

### A read function will read the file of the chosen type and return a DataFrame. To check which read_ functions exist, you can refer to the pandas documentation.

In [3]:
df = pd.read_csv('../data/gender_submission.csv')

In [4]:
df

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

## To improve the visualization of the data set stored in df a bit, I will use the sample function, which takes a random sample from your data set.

In [5]:
df.sample(5)

     PassengerId  Survived
150         1042         1
191         1083         0
3            895         0
151         1043         0
163         1055         0

## You can use the .head and .tail functions to see the beginning and the end of the dataframe, respectively.

In [6]:
df.head(3)

   PassengerId  Survived
0          892         0
1          893         1
2          894         0

In [7]:
df.tail(3)

     PassengerId  Survived
415         1307         0
416         1308         0
417         1309         0

# How to Treat Our DataFrame?

### To properly handle our DataFrame, some precautions are needed, which are:
### All columns should be standardized (either lowercase or uppercase).
### All key columns should have the same name, in case you want to do a join, merge, concat (joining two tables by a key).
### All rows need to be of the same type.
### In some cases, it is necessary to check if there are specific rules for those rows. Example: you have a CRM column and this CRM needs to be standardized with 2 letters for the state followed by 7 digits with the CRM at the end.

In [8]:
df.dtypes

NameError: name 'df' is not defined

# loc, iloc Functions (SQL SELECT)

### The loc function works like the SELECT in SQL, where you select one or more rows according to a given condition.

### The iloc function also works like the SELECT in SQL, but the condition here is the number of the row you want to see.

# loc

In [9]:
df.loc[df['PassengerId'] == 1200]

     PassengerId  Survived
308         1200         0

In [10]:
df.loc[df['PassengerId'] <= 900]

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1
5          897         0
6          898         1
7          899         0
8          900         1

## In the example below, I will apply some conditions inside my loc where | means or and & means and.

### Translating: I want to select the passenger IDs that are less than 895 or (Greater than 900 and Less than 905).

In [12]:
visualizacao1 = df.loc[(df['PassengerId'] <= 895) | (df['PassengerId'] >= 900) & (df['PassengerId'] <= 905)]

In [13]:
visualizacao1

    PassengerId  Survived
0           892         0
1           893         1
2           894         0
3           895         0
8           900         1
9           901         0
10          902         0
11          903         0
12          904         1
13          905         0

In [15]:
sobreviventes = df.loc[df['Survived'] == 1]

In [18]:
sobreviventes

     PassengerId  Survived
1            893         1
4            896         1
6            898         1
8            900         1
12           904         1
..           ...       ...
409         1301         1
410         1302         1
411         1303         1
412         1304         1
414         1306         1

[152 rows x 2 columns]

In [17]:
sobreviventes.shape

(152, 2)

In [16]:
sobreviventes.sample(5)

     PassengerId  Survived
382         1274         1
168         1060         1
22           914         1
88           980         1
32           924         1

# iloc

In [19]:
df.iloc[1]

PassengerId    893
Survived         1
Name: 1, dtype: int64

In [20]:
df.iloc[13]

PassengerId    905
Survived         0
Name: 13, dtype: int64

# If you want to specify a range of indices (rows), you need to use :, for example [0:10] goes from position 0 to position 9.

In [21]:
df.iloc[0:10]

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1
5          897         0
6          898         1
7          899         0
8          900         1
9          901         0

In [22]:
df.iloc[7:16]

    PassengerId  Survived
7           899         0
8           900         1
9           901         0
10          902         0
11          903         0
12          904         1
13          905         0
14          906         1
15          907         1

In [23]:
df.iloc[-1]

PassengerId    1309
Survived          0
Name: 417, dtype: int64

# With this, you can copy pieces of your DataFrame to other variables, making them into smaller dataframes!

In [24]:
df2 = df.loc[(df['PassengerId'] <= 895) | (df['PassengerId'] >= 900) & (df['PassengerId'] <= 905)]

In [25]:
df3 = df.iloc[7:16]

In [26]:
df2

    PassengerId  Survived
0           892         0
1           893         1
2           894         0
3           895         0
8           900         1
9           901         0
10          902         0
11          903         0
12          904         1
13          905         0

In [27]:
df3

    PassengerId  Survived
7           899         0
8           900         1
9           901         0
10          902         0
11          903         0
12          904         1
13          905         0
14          906         1
15          907         1

# rename and drop Functions

## As the self-explanatory names suggest, these are functions to rename and drop columns or rows from our DataFrame.

### Let's suppose we have a column full of null values, why not drop it since it will only be garbage?

### Or in the case where we need to rename some columns, so that the names are more explanatory.

In [ ]:
import numpy as np

In [28]:
df['null_values'] = np.nan

In [29]:
df.sample(3)

     PassengerId  Survived  valores_nulos
156         1048         1            NaN
252         1144         0            NaN
64           956         0            NaN

In [30]:
df.drop(columns = 'null_values')

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [31]:
df.sample(3) #didn't we delete it??

     PassengerId  Survived  valores_nulos
65           957         1            NaN
326         1218         1            NaN
362         1254         1            NaN

## In this case, the functions do not apply by themselves, so we need to pass a parameter called inplace = True.

In [ ]:
df = df.drop(columns = 'valores_nulos')

In [32]:
df.drop(columns = 'valores_nulos',inplace = True)

In [33]:
df.sample(3)

     PassengerId  Survived
126         1018         0
308         1200         0
372         1264         0

In [34]:
df.rename(columns = {'PassengerId' : 'id_passageiro'})

     id_passageiro  Survived
0              892         0
1              893         1
2              894         0
3              895         0
4              896         1
..             ...       ...
413           1305         0
414           1306         1
415           1307         0
416           1308         0
417           1309         0

[418 rows x 2 columns]

In [35]:
df.sample(3) #The inplace, we must remember the inplace!!

     PassengerId  Survived
68           960         0
386         1278         0
97           989         0

In [36]:
df.rename(columns = {'PassengerId' : 'id_passageiro'}, inplace = True)

In [37]:
df.sample(3)

     id_passageiro  Survived
148           1040         0
388           1280         0
277           1169         0

# Merge and Concat

### Merge is a join function where you will have one or more keys that will be joined with the keys of other tables, thus you can increase the number of columns of a DataFrame. This function can be compared to the JOIN in SQL (Note that pandas also has a join function that does the same).

### Concat is the function that concatenates two dataframes by adding more rows to it, for example:

In [38]:
s1 = pd.Series(['a', 'b'])

In [39]:
s2 = pd.Series(['c', 'd'])

In [40]:
s1

0    a
1    b
dtype: object

In [41]:
s2

0    c
1    d
dtype: object

In [43]:
pd.concat([s1, s2]).reset_index(drop=True)

0    a
1    b
2    c
3    d
dtype: object

# One example of merge

In [44]:
df2 = pd.read_csv('../data/test.csv')

In [45]:
df2.sample(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.05,NaN,S
176,1068,2,"Sincock, Miss. Maude",female,20.0,0,0,C.A. 33112,36.75,NaN,S
276,1168,2,"Parker, Mr. Clifford Richard",male,28.0,0,0,SC 14888,10.50,NaN,S

In [46]:
df2.rename(columns={'PassengerId': 'id_passageiro'},inplace = True)

In [47]:
df.sample(3)

     id_passageiro  Survived
388           1280         0
222           1114         1
190           1082         0

In [48]:
df2.sample(3)

,id_passageiro,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
111,1003,3,"Shine, Miss. Ellen Natalia",female,NaN,0,0,330968,7.7792,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
276,1168,2,"Parker, Mr. Clifford Richard",male,28.0,0,0,SC 14888,10.5000,NaN,S

## Before doing the merge, note that we have two columns, id_passageiro, and it's only in the df with the Survived column.

In [49]:
merged = pd.merge(df2,df,how = 'left', on= 'id_passageiro')

In [50]:
merged.sample(3)

,id_passageiro,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
396,1288,3,"Colbert, Mr. Patrick",male,24.0,0,0,371109,7.2500,NaN,Q,0
56,948,3,"Cor, Mr. Bartol",male,35.0,0,0,349230,7.8958,NaN,S,0
75,967,1,"Keeping, Mr. Edwin",male,32.5,0,0,113503,211.5000,C132,C,0

## Explaining the function: the first parameter passed was left = df2, in this case, we are placing this dataframe on the left.
## right = df, which is the dataframe we are placing on the right.
## how = 'left', meaning we should keep the one on the right and look for missing values from the right.
## on = 'id_passageiro', our key for merging.

## With this, we brought the Survived column to the Test DataFrame.

# Podemos criar agrupamentos específicos também em nossos dataframes com a função pd.groupby assim criando diferentes visualizações

In [51]:
merged.sample(3)

,id_passageiro,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
105,997,3,"Holthen, Mr. Johan Martin",male,28.00,0,0,C 4001,22.525,NaN,S,0
227,1119,3,"McNeill, Miss. Bridget",female,NaN,0,0,370368,7.750,NaN,Q,1
281,1173,3,"Peacock, Master. Alfred Edward",male,0.75,1,1,SOTON/O.Q. 3101315,13.775,NaN,S,0

In [52]:
merged.groupby(by = ['id_passageiro','Name','Sex']).agg({'Age': 'mean','Fare':'min'})

,,,Age,Fare
id_passageiro,Name,Sex,,
892,"Kelly, Mr. James",male,34.5,7.8292
893,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,7.0000
894,"Myles, Mr. Thomas Francis",male,62.0,9.6875
895,"Wirz, Mr. Albert",male,27.0,8.6625
896,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,12.2875
...,...,...,...,...
1305,"Spector, Mr. Woolf",male,NaN,8.0500
1306,"Oliva y Ocana, Dona. Fermina",female,39.0,108.9000
1307,"Saether, Mr. Simon Sivertsen",male,38.5,7.2500
1308,"Ware, Mr. Frederick",male,NaN,8.0500
1309,"Peter, Master. Michael J",male,NaN,22.3583

# We can also create specific groupings in our dataframes with the function pd.groupby, thus creating different visualizations.

# Finally, when we finish our normalization, there is the to_ function, where you choose how you want and where to save your data!

In [56]:
merged.to_csv(path_or_buf = '../data/created.csv')

In [57]:
criado = pd.read_csv('../data/created.csv')

In [58]:
criado.sample(3)

,Unnamed: 0,id_passageiro,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
243,243,1135,3,"Hyman, Mr. Abraham",male,NaN,0,0,3470,7.8875,NaN,S,0
214,214,1106,3,"Andersson, Miss. Ida Augusta Margareta",female,38.0,4,2,347091,7.7750,NaN,S,1
108,108,1000,3,"Willer, Mr. Aaron (Abi Weller"")""",male,NaN,0,0,3410,8.7125,NaN,S,0